{"tweets": ["He was just trying to say cancel culture can be hypocritical.", "People are imperfect and the better than average ones recognize that and make attempts to grow.", "You have to literally stop showing cancel culture any respect since they are seriously willing to make you unemployable because od hurt feelings online.", "You see Laura, when we conservatives take our business elsewhere its perfectly rational.", "Dont you know that cancel culture is toxic? Ill fucking fight and stab every one of you.", "No congressperson that voted to authorize force? Only those with clean hands can speak on the state of American foreign policy right now? Cancel culture is wild.", "Cancel Culture the belief that you can bitch something out of existence.", "Cancelculture Istandwithdoncherry Nowhere in that coaches corner segment did Don Cherry singleout immigrants or newcomers.", "She made the bed but cant figure out why its still so messy.", "Yes I would like to take you up on your offer to cancel culture.", "Getting told i should kill myself over how someone else answered questions is definitely the new cancer I mean, Cancel culture.", "Its been fun with all these woke movements and cancel culture but ladies and gentlemen.", "Even if we accept Cancel Culture as a real thing it aint its not a hindrance to growth.", "Its interest is power domination and change is the vein pulled over true intent.", "This is the problem with social media, it impulses cancel culture and creates more division.", "They were saying dumb shit! people grow up!! its the ones who said shit when they were adults that you gotta watch out for! And even then ppl grow! cancel culture is so dumb.", "But just remember that before you go all the way in.", "Or are people just using opportunities to bash and complain?! especially when clout is involved.", "Local media digs through his social media and finds 8 year old tweets from when he was an idiot teenager for their story.", "Very excited about this! See you there! Mañana estaré en las Violet Nights de Southbank Centre compartiendo un panel sobre la Cancelculture.", "Im really sad because of stans twitter are always ready to fight and principally do the cancel culture with someone made a mistake, its hypocritical.", "I guess parts of breadtube still think thats real in the face of criticism Cancel culture trying to cancel one of the funniest comedians on Earth whos giving his fortune to animal protection.", "Or a cp artist lying about a fucking plush doll and a plethora of other things for clout Highkey sad yall r tryna cancel the instead of working w him and educating him.", "The comedy wanna bes back in the day left stand up pretty fast cause it was too damn hard, now they become bloggers.", "8 Cancel Culture I probe s mind about what cancel culture is! So people are adding a lot of yea but what if they did xyz to this tweet.", "And if we get rid of the latter, the first part will go away naturally.", "Lt; lt; The irony is that cancel culture cancelled jobs for a lot women which kinda defeats the purpose.", "This is the last I will say on the topic of cancel culture you all need to differentiate between problematic and irredemable because those are not the same.", "Supporters of cancel culture are the person in the lifeboat who picks who their going to eat before the supplies run out.", "Point is doing a story on cancel culture where you only hear from the canceled is like doing a story on Weinstein where the only people you interview are him and his people.", "If you think that Maya getting turned down for contract renewal due to consistent and persistent transphobia is cancel culture, you have no idea what you are talking about.", "He had a lot of thoughtful things to say about the Marc Crawford situation, cancel culture, and how we can best progress as a sport and a society.", "We are all Logged On so we can all participate in the conversation.", "People are afraid of transparency but transparency is the only way to humanize the branding If you let people know they can hurt you, theyll keep doing so.", "Hollywood people think we should just get over it because his victim has tried really hard to move on with her life.", "You probably dont want to hear this but cancel culture is a direct product of privilege and entitlement.", "What was cancelled was cancel culture thanks to Michaeljackson and Davechapelle Stans and cancel culture is wack.", "Smh Cancel culture really is fucking crazy in this gaming community Cancel culture corny asf I have no clue, they just really like witch hunting I guess.", "Cancel culture multiple times this year and Im not proud of it.", "Its weird how cancel culture finally hit its limit with this guy.", "Some of the people in our country cancel just to look important or smart not because of what they really truly feel about a subject or person.", "The New York Times Cancel culture is why Brett Kavanaugh currently sitting on the Supreme Court.", "Tweet to that thread, I would observe that the whole point of the irs persecution was to slow walk the paperwork on those Tea Party groups to keep them quiet during the 2012 election.", "Lets hope she understands the problematic way shes addressed questions and learns to be more responsible with her words.", "The Cenk blog thing is an instance of petty cancel culture being weaponized and I dont like to generalize typically but should now be evident we wont tattle tale our way to power.", "This like they did to finding out Stephen Ross owns Soulcycle.", "1 presupone que este mal lo que hizo sin mucha indagacion; 2 no le da chance de defenderse ni aprender de sus errores La cancel culture se deberia llamar superioridad moral culture.", "Like you can acknowledge that quote unquote Cancel Culture causes some problems and also believe that people should be less mean and racist and homophobic.", "An Iowa reporter wrote about a viral security guards past offensive tweets after he donated a bunch of money to charity.", "Its why Perfect Blue scares me, its why I only give my po Box when asked instead of posting it, people scare me, its hard enough holding myself to my own standards.", "How u gonna cancel Gucci if youve never bought anything from there? Cancel culture is for dummies.", "This is where cancel culture may come in handy Im never gonna be apart of the boycott cancel culture tribes.", "I dont care for it at all people gonna still do what they want Its all business.", "This is just the tip of the fucking iceberg with Scientology.", "Especially in this cancel culture we have nowadays, all yall are doing is shaping conversation for people to not even be understood.", "Im not defending James Charles but there is no need for all of this.", "Decent people they learn from the mistake graciously instead of being victimized assholes about it forever.", "Trending backlashes, anger, outrage and cancel culture stuff on all sides of political spectrum.", "Uh, against cancel culture, but fuckin hell I can have a cheat meal, lets cancel Cancel Culture has now deleted an entire nation.", "But I believe a critique of cancel culture that elides it with the actions of an authoritarian state is irresponsible.", "Theyd all be saying support mx5 or youre not a real monbebe ive.", "Its the type of thinking that got Emmitt Till killed, and all the blue ticks since January have been slandering him.", "Cancelculture apply to her as well? What has the left taught Americas future journalists? To fear, and erase history, to kneel and to beg forgiveness.", "I would agree, but these people who do this need to suffer at their own hands for cancel culture to stop.", "Its not like the Astros were quick to let him go either.", "4 disaster Cancel Culture is what we call it because no one takes sjw seriously anymore as an insult.", "Reading the replies here, its another data point on how people take a popular phrase and project whatever they want onto it.", "Like admit youre a hypocrite just like the rest of us and move on dickhead This might be an unpopular opinion, but I think cancel culture is fine if we also have a culture of forgiveness.", "Now these people want a former Governor to not give credibility to a guy who called Obama a Muslim who should be hung for treason.", "Guess covering up a pedophile ring isnt an important enough issue for the Me Too movement or the cancel culture? What a bunch of phony cowards.", "Key point its easy to think that anything you focus on or study cancel culture, Black crime, white racism, hate is an epidemic.", "Handpickedoutrage Gotta proof read ya tweets nowadays with cancel culture youpeople are ruining innocent peoples lives with your Cancelculture.", "Once enough Leftists are taken down by its own Cancelculture only then will they start crying about how unfair, heavy handed and unforgiving it is.", "Any assessment of this history must conclude that the objections to cancel culture are not so much concerned with the weapon, as the kind of people who now seek to wield it.", "Liberals are angry about Chappelle show because hes calling out their tactics of gaining power Cancelculture being used to destroy everyone and anyone they dont like.", "We normies would be fired, and liberals would never forgive you.", "Its Next Victim Baby Yoda Didnt they abbreviate it to stop cancel culture? Regarding drama I try my best not to take a side unless I fully need to.", "Its gotten out of hand amp; has turned into a safety blanket to have a reason to bully someone to the point of suicide.", "I dont see anything bad in believing that someone is capable of reflecting on and learning from their wrongdoings to change and become a better person.", "The homie Adrian Maree Brown sharing some great opening thoughts about organizing in this moment.", "Obama called out and shamed cancel culture Twitter announces it will no longer promote politics Thats not activism.", "I hope yall jump all over the Des Moines Register for ruining a real feel good story with cancel culture.", "U pls cancel my depressiom thnx Les ravages du politiquement correct impose par.", "The Healing Space Podcast np on Soundcloud you cant attribute someone elses name to some shit they didnt write especially in this weird cancel culture were in now.", "Learn how to fucking educate yourselves first and see both sides of the story before jumping into the whole hate cancel culture.", "The fucking nerve of you people bitching about cancel culture when evidence to the contrary is literally putting ketchup on an overdone steak in the bowels of the White House.", "We live in a racist, homophobic, transphobic, misogynistic, classist, ableist, superficial culture amp; all of us have internalized some bullshit amp; are going to mess up.", "There is no cancel culture on twitter! There is no cancel culture on twitter! There is no cancel culture on twitter! The cancel culture is flawed.", "If theyre coming after me for that, I cant wait for the cancel culture mob to see my special.", "See now the problem is people care more about cancelling the Ace Family than the actual issue at hand.", "Cancel culture is stupid Halseyisoverparty Cancel culture is toxic and really harmful to someone.", "Obama is right, but hes not criticizing cancel culture alone whatever you think that is.", "But Please Still Share It! End Cancel Culture now! Cancel culture and trial by Twitter destroys lives.", "Cancel culture is a disease Man raises 1 million for childrens hospital, gets condemned for tweet he wrote when he was a sophomore in high school by reporter who then had his own racist tweets dug up.", "And one must be consistent in opposing this nonsense whether you call it cancel culture or not.", "Im allowed again?? Cancel culture is the online equivalent of jungle justice.", "New York Times, bristling with indignation that someone might investigate them.", "His Issue With Cancel Culture and Why He Embraced Xxxtentacion Cancel Culture, calling people Trash, amp; all that negative Bullshit gotta go.", "If youre the same person you were 6 years ago Im sorry for your boring ass life.", "Do you think mistakes are for? No one is perfect all the time.", "Cancel Culture, Woke Purity icymi Funny how most people who criticize cancel culture for not being nuanced, dont have nuanced conversations about cancel culture.", "Why are you defending a rich celebrity??? Any normal person would face real consequences for certain shit.", "Now as much it would be cool if Hunter decides This is what real Cancelculture is.", "They know they can cry a few tears, give a half ass apology and be a okay.", "It can be a magnetic, attractive, thrilling choice but constant identification with abusive people? Isnt depth.", "Guy raises over a million dollars by accident just asking for beer money.", "Cancel culture is a fools errands that wishes to erase the contradictions around us by eradicating the processes that reflect the messy work of reconciliation.", "You Cannot Have The Dominican Republic Dominicanrepublic Cancel Culture, grandstanding, virtue signalling etc are some of the devices then used to validate these communities.", "But will leave it unedited dios la cancel culture es lo más pelotudo que existe saben por qué? porque no existe gente literalmente es imposible cancelar a alguien Sweetie.", "First of all, cancel culture es nnfbfbgbg no deja margen a que el cancelado cometa errores y aprenda de ellos.", "Cancel culture Is it toast? Cancel culture is hateful which is ironic because the whole reason it exists is because we were trying to make the world less hateful.", "Thus any sober assessment of this history must conclude that the present objections to cancel culture are not so much concerned with the weapon, as the kind of people who now seek to wield it.", "Obama is veering off the script Cancel culture is boycott culture, which has existed since forever in society.", "My recent tweet about the cancel culture elicited the response I expected.", "Cancel culture is terrible and toxic you can be praised this morning and get cancelled in the evening depending on who has a story to spin about you on social media.", "Dont like Commentary on ideologically motivated criticism and cancel culture by one of the best critics modern entertainment over at Midnights Edge, using the case of Rambo Last Blood.", "You really cant tell your profession on social media because Cancel Culture is raised on being sensitive and bitch made.", "Nobody was trying to cancel Etika, though the fallout makes it seem like the exact same thing.", "Combatting trashy men culture doesnt happen in the form of cancel culture.", "Look at what a well dressed, articulate Alt Spacenoid I am! Char in cca omg cancel culture wont let me make earth sphere great again!!!! gotta educate and give access to resources.", "I dont have an example in front of me, but I cant believe that a leftist like hasnt been a big contributor of the Cancelculture.", "This time? Cancelcancelculture Its always these insecure ass nobodys who perpetuate cancel culture but you know damn well they wont say a fucking word in real life.", "If you sensitive or apart of cancel culture, stand up comedy just isnt for.", "Dave Chappelle Calls Out Cancel Culture Worst Motherf kers Ive Ever Tried to Entertain Jesus, be any kind of televised standup where no one does a riff about triggers and cancel culture.", "Chris Brown playlist on and, myriad problematic personal issues aside cancel culture curators, no need to engage me with me here, hes made some bloody good music.", "No cancel culture, there are some embarrassing comments made by partisans that get quickly fact checked.", "Youre blocked kid Cancel Culture 1 Mugsy 0 Fs in the chat bois stan twitter, you know its ok to step back and admit when theres a topic youre not educated on enough to argue about right.", "Ios Android Spotify Kevin Hart is literally doing a woe is me I cant just tweet slurs, youre all sensitive netflix series and were still acting like cancel culture is a tangible thing.", "No different than papa johns, Gucci, or Starbucks I just feel like the cancel culture meme is an attempt to suggest that innocent people get caught up in unreasonable purity tests.", "52 different people nuh uh! ive watched all your videos! Whats crazy is its clear to me this is directed at cancel culture toward racists and homophobes.", "Say what you want about cancel culture, but if puts egotistical little shits on mute for a while, that shit is necessary.", "Cancel culture is anti Black and needs to be returned back to the High School teen flick yall stole it from.", "Its not; cancel culture is just a collective dislike for someone something for their actions, this is a part of human history, its never not existed.", "Cancel culture mostly over words vs anything goes with giving in to your sexual desires, etc.", "You sir, have just become a minor embodiment of cancel culture.", "Idk why im so sad about it now like i wish she would just be quiet sometimes but no, fuck that.", "Its Knees Southpark co creater Matt Stone weighed in on the timely topic of Cancelculture in the entertainment industry.", "Am I gonna exclude them from the struggle regarding the primary contradiction because of this, and risk my rent and groceries? Hell no Cancel culture, but make it student loan debt.", "New pentagrim Lots of the regulations dont start with the government.", "This person is being portrayed as the victim of cancel culture.", "Some people need to be called the fuck out or theyll never learn that theyre wrong and that acknowledgement needs to come before anything else.", "That statement is way too nuanced to be labeled as cancel culture.", "Le cancel culture est stupide lorsquil porte sur des auteurs dun autre temps, dune autre époque.", "But gosh darn it, York Peppermint Patties is where I draw the line people!! Woke cancel culture is ruining our candy selec The Left cancel culture Lol, Nope.", "Those who were complaining about the bbc interviewing Ben Shapiro were cheering for it ten minutes later.", "Hes done a lot for film amp; horror, this is a historically bad look amp; take.", "Friendly reminder Cancel Culture isnt about social justice its about deploying misery.", "Ive spoken openly before about these negative cesspools we tend to mentally spiral into, as far as gaming news and cancel culture.", "Be productive not destructive Thats just my view on this Thingsweshouldcancel trend though.", "You cant fake it forever, its only a matter of time before the cancel culture destroys them too.", "Im saying is, pay attention to who actually is part of cancel culture, who actually does manufacture outrage.", "Good question amp; we should stop coddling and letting folks go but we both know how society is amp; how folks look out for each other even when in the wrong.", "Read my new one exclusively in the worlds most awesome alternative weekly! Cancelculture Just re listened to this Obama clip criticizing woke politics and cancel culture.", "Folks are hellbent on projecting their own refusal to grow from who they were at 20 something and hatred of cancel culture on Eddie.", "Full vid on ig haley morales knows how much power her name holds to this poor girl.", "Cancel culture is only a thing if its toward a conservative.", "But a moment of seriousness cancel culture is a cancer and I do not take part in real cancel culture.", "I am mourning his death, this thread is from April 15th, the same day he tweeted this.", "Culture Well reasoned piece from The New York Times Teen Fiction and the Perils of Cancel Culture we get it, nobody likes accountability Nigeria needs a cancel culture.", "Sanity wins, Cancelculture loses Carsonking I want to cancel cancel culture.", "Gabbiehannaisoverparty in this cancel culture, I vote to cancel their daca.", "Except it isnt the marginalized, voiceless communities youre paternalistically fetishizing who are leading the woke cancel culture charge.", "There is also the failure of allowing atonement, ever, and those who are outright wronged, never get their due process.", "Tell the 95 how to live what to think and feel lgtb are already over represented on tv at 11 There is nothing wrong with one channel staying away from sjw nonsense Cancel culture about to hit Kroenke.", "Folks who constantly deride and are disproportionally incensed by cancel culture give off the same vibe tbh.", "Im like 78 sure that black twitter creates 90 of the trendy content on here.", "Dont take this wrong but when I last left Australia in September of 2016, I vowed that Id never come back.", "But the timing here came across as inappropriate at best and exploitative at worst.", "His firing wasnt a product of cancel culture, it was a product of his own crap behaviour amp; a salary he was no longer worth.", "I feel like Im watching a black Last Man Standing Spot on.", "Writingcommunity amwriting amreading writerproblems via Jssnskwnksjw bitch who is trying to cancel Maya if you dont shut the fuck up.", "Its an all new ep of suckittt w me amp;! Tune into our discussion on Cancelculture amp; the iconic Janefonda Are we going too far? Or not far enough? This discussion amp; more w spesh guest.", "See you there! Mañana estaré en las Violet Nights de Southbank Centre compartiendo un panel sobre la Cancelculture.", "The media does it they claim some bullshit public interest angle, but its just pure sensationalism.", "Yall go check it out Black solidarity! She could have cancelled amp; kept quite.", "The root of cancel culture? unpopular opinion people are quick to jump on the cancel culture or hate trend because they love drama and want likes Rts or followers.", "Ohhhh snap! did a video about the Trisha situation and cancel culture! Time to watch! cancel culture literally is not real?????? jameela and co.", "This Trudeau scandal is exactly why Im not really a fan of cancel culture.", "Listen to Episode 24 The Cancel Culture by np on Soundcloud a friend and I were chatting about this recently.", "Finally has a culture! Accountability keeps being mistyped as cancel culture.", "Cancel culture and here comes Harvey fucking Weinstein and the bastards that still support and coddle him in this industry proving once again that it doesnt exist.", "Cancel culture, problematic brands and why I scrapped my Baby Phat x Forever 21 Review via Cancel culture has been cancelled but If we cant carry Snacks on the train, sgr is cancelled.", "Im not a fan of Cancel Culture at all for a myriad of reasons and if you think Blackface is harmless in 2019 then youre an idiot outchea in these streets and evolution will take you out.", "You must obey the Leftist mantra or we will cancel you.", "Some of you are quick with cancel culture instead of just talking shit out.", "But I wish people would feel the same when it comes to how Roseanne was treated Im often reminded of what society has become with social media.", "Remember this tweet when this kid is whining about cancel culture for the next 30 years.", "She sits down with to recount her fight against the politically correct.", "But I still have this question of whether its okay to play them or own them.", "Slams Woke Cancel Culture, Far left Media Collapses, The Beginning Of The end Woke Far Left Obama saying cancel culture isnt activism? Its like.", "Taylor Swift with your daily reminder that cancel culture is dangerous and should itself be cancelled i truly truly truly love these cancel culture idiots.", "Im firmly against cancel culture but Rosanne Barrs son makes many good points here.", "Lots of people complaining about cancel culture while making a lot of money telling the same transphobic jokes that arent even funny lol.", "We Interviewed One Psychologist Cautioned for Making Assessments with Insufficient Information and He Says Definitely, Yes My latest for the Cancel culture.", "People say dumb shit, what actually matters is if they grow from it and apologize.", "We cant be that The real problem with cancel culture is that no one could survive it, universally applied.", "Meghanmarkle The fact that one have to defend Jeffgoldblum for his statement shows how far the Clownworld gone and its Cancelculture! And you are right, Jeff Goldblum, Innocentuntilprovenguilty.", "It doesnt seem to hurt the people it should hurt, it benefits bad people, and marginalized people can have their lives upended by comparably small offenses.", "I want to remind you all that social justice through bullying, emotional abuse, threats, and cancel culture is not ok.", "Let me be logged in that day There really is a difference between problematic behavior and problematic people.", "He even took time out of his day to scold the cancel culture.", "This story was retweeting an article suggesting that cancel culture isnt a real thing.", "And I dont understand the wicked things we do in this world of ours.", "New Shethinks! joined to discuss fighting back against Cancelculture, s Walkaway, attending a event in celebration of criminal justice reform plus more.", "This but theres no such fucking thing as cancel culture get a goddamn life Least fav new genre Moral authority techno.", "Apologizing to professionally offended terrorists, as I call them, and doing everything they demand out of fear of backlash should also become a thing of the past.", "Im censoring the good guy, since he hasnt consented to being dragged into this mess.", "Cancel culture is wrong regardless of who is doing the canceling.", "She is consistent in her message just like the Ellen tweet.", "Im never doing business with them ever again!! They have been cance I mean.", "However I have to imagine a lot of people upset over this were fine with South Park making fun of every person who died ever.", "So obviously the best place to have this conversation is Twitter.", "The shitty thing he said today is completely unrelated to that instance and just to solidify it one more time cancel culture is trash.", "Cole Speaks Out On Cancel Culture, The Trouble With Fame and Schooling Young Rappers via he also spoke openly about this friendship with xxxtentacion before his passing.", "It happens, so yall might want to have room for it in your takes.", "Lots of people talk about the toxicity of theatre twitter, and yes, there a lack of nuance and yes cancel culture etc.", "They want people to be savvy in whatever they do but theyre not savvy with their judgement.", "May I interest you in an underwater house? One of the replies in my lrt says that cancel culture was the reason why Jesus was crucified.", "Cancel culture going to add Amberheardisoverparty to the list? Offense is a good reason for engagement.", "Shame really but guess he doesnt care about having female fans? We back.", "Cancel culture, ultimately, is little more than being accountable for your actions, writes.", "We have been canceling entertainers for years for much less than bigotry past behavior.", "The first sentence of this piece should concern you demand action.", "For Hernán Cortés in Mexico Most people will advocate for cancel culture until theyre the ones on the wrong side.", "It can be a tricky situation to deal with and one which requires strong leadership to manage.", "However, I would like to see them grow from these recent events and be better.", "Simply put, you wouldnt get cancelled if didnt say do oppressive ish.", "Lmao you guys call this animal abuse imagine that cancelculture The cancel culture should really be cancelled.", "So Cancel Culture, begone! Swear She Was Going Off Im Not Here For The Cancel Culture They Be Wanting You To Argue With Them Cancel culture is mental illness.", "Yes, he should be more politically educated but you cant blame him for not answering, especially with cancel culture nowadays.", "Im so sick of cancel culture I agree, we should cancel culture.", "My perfect ticket is still you as vp with as potus.", "For those interested, I was interviewed for the abc about callout and cancel culture.", "This Sunday please tune in for my chat with well be talking therapists, Kanye, cancel culture and more for Profile This is essentially why cancel culture isnt a thing.", "Example of why Social Media Justice and Cancel Culture has to get out of here!!!! Yall do the most with the least amp; now u lookin dumb.", "And heres Tobin, joining his leftist pals in the gutter trying to slime another good person with the Cancelculture politics of division.", "Therefore a victim of cancel culture Why wasnt it called Cancelculture when Dr.", "I really hate the term cancel culture but I enjoyed this frank discussion about the prevailing story in the nhl right now between and Robin Lehner.", "It doesnt allow ppl to learn from their mistakes or better themselves.", "I would rather have different rules, but if the only way to cancel cancel culture is to cancel the cancelers, so be it.", "And cancel culture, youre transparent af The cancel culture on twitter just another sign that folks live in their own bubble and dont go outside of it.", "Choose not to associate with someone or Cancel culture like antifa should be confronted with aggressive police force.", "All to get the clicks now, all to sell papers then.", "The words Cancel Culture can go away but not the act.", "There is a good argument to be made for the guys innocence when you read court documents and dont just swallow up a one sided documentary and media brainwash.", "Just look how they treat Kanye or any other black who leaves.", "Im also really concerned with the media doing that and us as Democrats cannibalizing each other with so much negativity that we feed into the cancel culture ultimately shooting ourselves in the foot.", "Its a thing someone says because they heard someone else say it Ladies are very loud on tl but were also going to see them at these clubs.", "The problem with cancelculture is the same as the problem with the Loch Ness monster, the boogie man, and Santa Claus They dont exist.", "This episode of Family Guy has Brian tweeting out a really bad racist joke and now his life is ruined because of the tweet.", "Im so sorry about the whole cancel culture thing but it needed to be said.", "Im not into cancel culture but guess who made into the exceptions? This applies in cancel culture too.", "Cancel Culture how much is enough? Cancel culture is draining life out of me The Government Guarantees Free Speech, Not Consequence Free Speech.", "Surely your position should be contingent on who is being cancelled and why.", "Lets be real, we are in a cancel culture where youll risk your job not to sign such a letter.", "The roots of cancel culture are real and are derived from cultural boycotts.", "That want to take our guns, raise taxes, keep the borders open, kill unborn babies, cow tow to the America hating un, and appoint far left judges.", "Dobetter Friday came early this week check out my new single Cancel Culture in about 30 min with me! Im not one for cancel culture.", "I cannot remember, there are essentially two completely different things called Cancel Culture.", "What that means for Kanye and cancel culture is something I dont feel like thinking about right now.", "He was all cancel culture when Dolce and Gabbana said gay people having kids through ivf is wrong.", "This is literally why it sucks, people always do it when they use it for a small issue but never for bigger issues Cancel culture is so stupid.", "People complaining about Cancel Culture more than the actual people trying to cancel.", "I blocked bigsean Why I blocked theykilledsix Dreamville amp; nickcannon Why I think Cole vs dot is a bad idea Cancel culture Rappers amp; women rights Rap history amp; much more.", "This man cancel culture dont apply to white folks, mans said some racist shit and still getting a bag.", "When moderates like me denounced cancel culture, expeditive careless punishments amp; social justices propension to harm innocents, thats what we were warning against.", "Its almost as if they have no consistent ethical stance other than fuck women and anyone who supports women.", "Explains why in his latest piece about Dave East and Lil Nas Xs Old Town Road.", "He solemnly chastises the Left for its cancel culture, its identity politics, its frontal assault on campus free speech, then engages in and stubbornly refuses to apologize for those very practices.", "So the cancel culture s only for d innocent michael? La primera víctima de cancel culture fue Plutón.", "Well said stop giving this cancel culture snow flakes social justice warriors a platform because they feed off that shit Cancel culture is calibrating, but I think as a whole its necessary.", "You Can Tell Me Anything, Anthony Atamanuik confesses that as young man he was an incel.", "Ok in the slightest I am also sympathetic to her being attacked by mobs of people online.", "The far left is loosing their collective minds over mean words said by the president at a political rally.", "We really think our generation invented Cancel Culture as if France didnt cancel Marie Antoinette.", "Looks like a residual effect of the Stan and cancel culture that social media creates.", "My God, putting Scarlett Johansson in the same category as Michael Jackson.", "This new trend of punishing people for old shit thats not illegal, opinions or jokes is annoying.", "When you cancel someone, all it does is force them to find comfort among people that tell them what they did is completely fine.", "So she can have the abusive bf back but I must lose my friend?.", "But people dont get cancelled for doing nothing I think people who have an issue with cancel culture have a guilty conscience.", "Yall need to understand that people learn and grow especially if they made the mistakes when they were teens but anyway Cancel culture is also something I cant wrap my head around.", "Dont talk about serious issues like sexual abuse on the radio, but oh so trendy to mute artists.", "I see why because what the entire fuck, sir? You dont even know what cancel culture is, including the fact that its a term made up by the worst ppl ever.", "But The Left Isnt Listening The Following Photo is Brought to You by Trumps Cancel Culture I hate cancel culture so much.", "Sticksandstones by Davechappelle keep it up Bill and I may condescend to follow you.", "While I think that cancel culture in general is ridiculously misguided and hypocritical, Im surprised that they have yet to cancel Do They Know Its Christmas?.", "Cancel culture works, people! Pennywise is a homophobic carnivorous clown that enjoys fat shaming his victims.", "بديت أمقت الcancel culture مبالغ فيه وكل خطأ وزلة يسترجعون الماضي والحاضر.", "Yall got on this internet amp; let cancel culture devour Brother Nature for stuff he tweeted when he was like 12.", "You really thought you got over on Rev Wright amp; you were going to hand this off to hrc amp; Tim Kaine.", "They were one of the first brands to take curvier diverse model starting with Tyra Banks, Naomi Campbell and the list goes on.", "No such thing as cancel culture if nobodys actually ever cancelled.", "I wish cancel culture was as powerful as yall pretend it is.", "About canceling anybody, yall use cancel culture against somebody you dont like but criticize it when your faves are called out.", "Or that was the idea, until the millionaires with Netflix specials decided to use the term too dave chappelle is funny.", "I love how cancel culture is never disputed for white supremacy racism, but cancelling misogynists, antiqueer, respectable, sexually violent folx is somehow a problem.", "Also how cancel culture and accountability culture are not the same thing.", "Bring until it boomerangs back to them reaping what they sow Cancel Culture sucks.", "God is right, we by nature actually hate Him because He is good, and were just.", "But you do realise that the backlash that you are experiencing is exactly what you are advocating for by defending this whole cancel culture vigilantism.", "I just assumed cancel culture was about making dinner plans in Los Angeles.", "I got 12 followers then cuz Ive repeatedly said how dumb cancel culture is.", "Im so done with cancel culture and people finding reasons to roast someone every six seconds.", "Yet He loved us so much that He made a way.", "Its always abt hating mmm coz your actions speaks louder than you focusing on your faves.", "Looks bad no matter what 1 He should have researched Cenk Uygur first, before he endorsed or 2 This is cowardly submission to Cancelculture Dont know, dont care what Cenk once said.", "For example, he defended the snl comedian who said racist things about asians and specifically about him, and said he shouldnt be fired.", "Theres still a lot of he said she said about the couple and the cheating but Im willing to say hes no pedo.", "Its the same mess other anti lgbtq people like Dave Chappelle already do.", "Can safely say this is the most disgusting side of the online art community.", "The pervasive and brutal societal phenomena whereby people.", "The solution is more complex than the problem.", "People do things they regret The cancel culture is getting out of hand if I want to draw a 17 y o with giant boobs and no organs I can fuck swj snowflake femin zis Donald Trump Jr.", "What few people will admit is that they feel powerless in their day to day lives.", "People concerned about cancel culture never mean this.", "Why Cancel Culture White Supremacy? Cancel culture and being woke and emotionally intelligent for social media got yall trippin.", "It doesnt really seek to correct bad behavior.", "Taylor Swift was cancelled in a time before cancel culture existed amp; it shows.", "So unless more evidence comes to light, I am going to continue to support Kyary.", "It nearly emotionaly destroyed Taylor, and now youre doing it to a fellow fan.", "Fuck cancel culture Everyone imposing their beliefs on others as the standard is just dumb.", "Al Frankens redemption tour Firing this reporter wasnt the right move any more than exposing Kings old tweets was the right move.", "Worth a Watch via People talk about modern cancel culture like we didnt all read The Scarlet Letter in high school.", "Cancel culture is good tbh cancel culture is so toxic and damaging to peoples careers!!!! Remember when radio stations across America boycotted Dixie Chicks because they said w.", "If you do one thing someone disagrees with youre branded for life and youre now a problematic toxic person with no way to redeem yourself.", "The democrats need to end the cancel culture purity test with candidates or theyre going to lose.", "I am firmly in the anti anti camp when it comes to that Cancel Culture piece.", "This shane dawson fucking his cat thing? I searched my ass off on twitter and there is no proof at all.", "Plus the Ratchet Report Atlanta Edition featuring snark fueled recaps of Bravotvs rhoa amp; Marriedtomed! Everyone knows she wont be.", "I hate Cancel Culture I hate that people are losing jobs and careers because they were assholes! The only cancel culture Im interested in is one where we Cancel Student Debt.", "Is completely perfect Cancel culture is disguised as an attempt to improve society, but its really an excuse to let peoples vitriol run loose.", "Facing the consiquenses of their actions is a good thing Perminantely demonizing them and never giving them a chance to grow, learn or show they have changed is not.", "Adversity breeds real success stories amp; better thought out opinions.", "And, of course, therere the racial hypocrites who condemn Michaeljackson but r quiet or sweet on famous and powerful whites accused of similar crimes or worse.", "This cancel culture because it is toxic and theres nothing good about it.", "We support an open discourse, a free marketplace of ideas!.", "Im a supporter of cancel culture especially when its over stuff like racism.", "New Episode!!! 136 Forgive the Intrusion Dan joins me to discuss forgiveness amp; cancel culture We also talk blackface, Kaep and ab, talent over morals plus play a game of Guess the Ethnicity.", "Eventually people are going to have to learn how to build brands that arent built exclusively on call out cancel culture or stabbing friends in the back.", "In Cancel Culture, the powerful dont give forgiveness, they take revenge.", "I was not wanna sit and watch as people like this got away with hurting and shaming people.", "Unfortunately Ive seen it a lot in the trans community too.", "This is why cancel culture should be cancelled.", "And all along, he knew hed done far worse than any of them.", "He also won against cancel culture in death too.", "Anyone who thinks cancel culture is a real thing should watch this clip, go back and look at the outrage at the time, and then look at how well this guys career has gone in the 3 years since.", "Whats going on behind the headlines and you shouldnt interfere much at all.", "Can we say Mortal Man lowkey coincided with the impending cancel culture shit back in 2015.", "So much backlash from the msm, anti sjw chuds put him on a pedastal until of course, they started cancelling him for stepping out of line.", "Moreover it masks the actual white supremacy co opting medieval studies by pretending this is all just cancel culture and all about the name.", "Keep them accountable, but keep them in the community.", "Can a petition do? On its own, nothing.", "Keep each other down ala crabs in a bucket so the rich popular dont have competition.", "He was working on something about cancel culture when he spoke at earlier this week; the final stop on his book tour.", "It should have failed or succeeded in the marketplace of ideas.", "The people accused of cancel culture dont have the power to cancel a damn thing.", "Simpler times Mw2 Clan Matches on Scrapyard and Terminal.", "Political correctness is a serious problem in the United States politicalcorrectness pc Pcculture Cancelculture Can we all just admit cancel culture is just bullying.", "Shanedawsonisoverparty shanedawsonisnotoverparty this cancel culture shit is so stupid sometimes.", "I see in some of you is what makes it worse.", "Is Nytimes the next victim of the Cancel Culture? Klrnradio I think youre awesome.", "Its gotten out of hand amp; has turned into a safety blanket to have a reason to bully someone to the point of suicide.", "No changing and who otherwise werent being held accountable? How Sarah Silverman Could Have Avoided Cancel Culture Cancel culture amp; acceptance culture go hand in hand.", "All love and peace! Hey, do you want to uh.", "Im not trying to start anything but people are allowed to stop stanning someone.", "Well, Davido and his people may have done this because Nigeria really do not have cancel culture.", "Its a good thing unless I decide to ascribe it to pc cancel culture amp; become intellectually morally stagnant instead of growing amp; maturing.", "Dont call getting rid of rapists and racists cancel culture.", "I hate cancel culture Cancel Culture is bad.", "It costs 0 to get your emotions in check.", "In the midst of these investigations I hope this cancel culture can be fair to the player and the card room if they handle it the right way.", "People try to improve and get shut down.", "What we can do is complicate our understanding of child sexual abuse and pedophilia Cancel culture is kinda like tumblr just on twitter Cancel culture needs to be cancelled.", "Anyways next time folks are talking bullshit about cancel culture, Im going to be all, You mean, like, the folks whose lives were destroyed by huac? Because you cant mean Lo is c k.", "You dont have any friends because you actively engage in cancel culture and are not emotionally mature enough to handle different opinions from yours.", "You ever consider I might get fomo for Wonder Woman? No, you only think about yourself.", "The Des Moines Register has fired their reporter and apologized for the way they covered Carson Kings 16 year old Tweets.", "Cancel culture to leave your lips until you understand the scorched earth policy glass blowers instated when riled up by a 10, 000 bong and some arrogant comments.", "While I do believe in calling out people for problematic behaviour, deciding someone is cancelled forever leaves no room for the fact we can all change.", "Okay but seriously, i feel like cancel culture goes too far sometimes.", "I dont think his point was to offend people.", "No Such Thing As Cancel Culture Cancel culture has claimed another victim.", "One of the worst things about cancel culture imo is that poc are always one accusation away from losing everything, while non poc seemingly have a safety net no matter what.", "I feel people express it only because they fear of being canceled cause they know they fucked up in the past The Cancel Culture once again aims at Quentintarantino and once again theyll fail.", "This is more like it, America first policies are catching on.", "If you are blocking people for making statements about issues w o ever mentioning you or your content all I have to say is that a hit dog will holler.", "They dont use logic, they will tell you if you say anything about their candidate you are part of a Cancel Culture even though they dont like labels.", "Teaching about marginalized histories and culture and the functions of ideologies is 100 necessary in primary mandated education to combat the spread of violent ideologies.", "Also Twitter Remember that time Arin Hanson did some shitty stuff a few years ago? Now you do! why is everyone so quick to hate on arin? its the internet, we all have opinions.", "Cancel Culture, Kamala Harris backlash, and more on The Breakfast Club video We are delighted to announce Aleah Scott as our third guest panel speaker for our talk on Cancelculture.", "You never know what someone is going through, and a bit of extra kindness daily goes a long way.", "If cancel culture really worked, thered be so many famous people outta business.", "Somehow the right pressuring or cancelling someone is never framed in this way.", "People grow and become their best self Seeing whats going on with Shane is so scary.", "Because you hate being held accountable for your problematic actions.", "But I think a lot of people are so happy that hes attacking cancel culture that they find the shit funny satisfying because hes attacking cancel culture.", "Then there wouldnt even be any movies or tv or stand up comedy because everyone would be offended over something.", "Please folks, cancel culture is never good I know from first hand experience.", "Who benefits? Noagenda wfp and its band of cancel culture ultra wokes have racialized the term tax payer.", "Cancel Culture and Pedestals by Me My Thoughts and Eyes.", "The thing is Ellen Degeneres wouldnt be in this big a shit storm had she not have doubled down amp; dcma take downed anyone.", "Its a loaded gun, designed to end lives off nothing more than a lie and a false or half truth.", "It is frequently perceived as a stance against control.", "Does that make me a victim of cancel culture? Cancel culture? You can try cancel my culture but I wont give up tartar sauce without a fight.", "If youre gonna call someone out, do it all the way Cancel culture has come to the capitol.", "When did we all lose our ability to think for ourselves? I feel like cancel culture is a direct response to stanning people.", "Welcome to cancel culture 101 Heres a protip dont use racial slurs hmmm Good luck with your future endeavors Cancel culture is bad, bad, bad.", "News for individuals who oppose cancel culture, woke extremism and progressive bullying.", "_ Cancel culture is nothing more than mob hunts against those whove gained a following.", "No les caiga encima por una cagada del pasado.", "And youre right, it is totally dumb to judge, condemn and order other people to cancel somebody what the hell does it even mean?, while not having any kind of knowledge.", "The Michael Jackson reckoning will reveal the limits of cancel culture.", "The latest Unnecessary Roughness is out and its some of the finest work of s career.", "Yes! Please let this be the end of people claiming to be woke, and the beginning of the end, at least, of this terrible cancel culture.", "People arent allowed to get wiser with age, change or grow in the cancel culture.", "But its apparent everywhere, and thats not cancel culture.", "Full Tranche Moist Im the only member of my club, but feel free to submit more words and I will gladly cancel them.", "This is a great thread! I was wondering why so many people were suddenly calling her racist and stuff, this thread approached the situation nicely.", "Boohoo, a millionaire shouldnt receive such a harsh punishment because he doesnt want to apologize for his shitty behavior in the past.", "Youd be surprised how much owning up to your missteps effects the situations.", "Just Dont Like while actively supporting known r pists and abusers.", "God fearing who serve in that place so they are motivated to abandon Charles Barkley Democrats Are Racist And Democrats Only Like Black Voters During Election Years.", "Afraid you might learn something other than leftist propaganda? a Bourdieusian and Marxist perspective of the Cancel culture by Peter Coffin.", "And yes, I strongly believe theres a racial angle in Metoo White celebrities r accused but black celebrities r jailed, may be going to jail or are targets for Cancelculture.", "If the same metrics you use against others are used for you in the area of your frailties.", "But you are not heroes for exposing or canceling people.", "The New York Times should experience some of this cancel culture they and other media outlets love so much.", "If someone is trying to educate themself and do better why are you attacking them The only comedian with a set of nuts big enough to take on the Outrageculture of today.", "Funny thing about it is people have made a name for themselves being victims to every little thing that comes across the tl cancel culture and its the lamest shit ever Death to Cancel Culture.", "Cancel culture does not exist, the sooner people realize this the less angry yall will be.", "Its basically privileged people who can dish it out but cant take it.", "Watch his video, he literally cleared himself but yall act all guilty until proven innocent and dont listen to the proof.", "He never said a word when it was happening to people on the right.", "Maybe everyone needs to start a campaign to stop taxpayers money nz equivalent from supporting these public universities that suppress free speech.", "Cancel culture isnt a thing, you snowflakes! absolutely nails it here.", "I literally hate cancel culture so much!!!!! Cancel Culture has gone so goddamn low, that people are canceling a 17 year old over a opinion.", "Cancel Culture To Stifle His Return to Stand Up via So the whole Trump impeachment thing is seeming more and more like a product of cancel culture.", "Do you think we, as a culture, can successfully cancel something or nah? new ep.", "I know I said some foul stuff back in the day but I did a semi scrub when cancel culture started gaining traction.", "Toniiiiight! Weve got a great show for yall.", "I hope they apologize get treated as the epitome of evil cancel culture.", "They deem immoral cancel culture is fucking stupid What would cancel culture look like for a medieval mob? and have some ideas.", "Tariq says only Male headed households should get reparations.", "Thrills from the soap box require no remorse.", "I never used to think I had ocd, but the fact that Cancel Culture is word of the year and it is 2 words is killing me.", "Im 39 and Ive been enjoying problematic shit my whole life.", "Cancel culture amp; acceptance culture go hand in hand.", "Kaya nga ikaw, ikaw na may access sa twitter and all, dont blame the uneducated voters.", "And as for the whole Cancel Culture I can say that Ive participated in this a few times but we really have to stop everyone makes mistakes its not up to us to bully and antagonize people.", "Were typed years ago, and Controversial themes scenes in movies.", "Just look at how fast the lynch mob appears online when innocent people are accused of crimes.", "Fightforwonho 스타쉽_우리가_답변을_원해 몬베베의_목소리를_들어봐요 원호탈퇴반대 Monbebe Monstax Wonhoweloveyou Wonhocomeback Cancel Culture On bbq Becky Put this racist on the wall of shame.", "The automatic cancel culture thats been planted in us gotta go Cancel culture doesnt really exist outside of twitter Cancel culture is what helped Trump get elected.", "The idea that the reported criticism can gets so twisted it no longer resembles the what actually happened Cancel culture seriously needs to stop.", "Period!! I will maybe believe in cancel culture if they truly get her out of here where tf is cancel culture when you need it? Buy amp; stream Nicetomeetya.", "God literally canceled the whole world because they werent doing the right thing with the flood, and he said hes gonna do it again with fire this time.", "Yall gotta let people speak whether its stupid asf or its insightful.", "I hope someday Ill be important enough for someone to go back thru my tweets for 7 years and find all the inappropriate ones.", "I dont know why so many are siding against Infil, to be honest.", "We, black folk, continue to wrestle w is our over eagerness to annoint Kings messiahs, to elevate folk to deities.", "While Cancelculture sometimes goes too far, this ignorant prick should never be anything but permanently unemployed.", "The irony is some of the people who support cancel culture for peoples past views are also fine with rehabilitating prisoners.", "Whatever canceling someone means to you then do it.", "Cancel culture is real and people like this is why it persists.", "What people call cancel culture that doesnt get called out enough is that if youre in a marginalised group youre gonna get hit with it a lot harder for less than if youre white, straight, cis, etc.", "I can make an exception Cancel culture and exposing is plain toxic and I can never understand why people want drama like that cancel culture is so toxic ugh.", "Heres to a 2019 filled with positivity Cancel culture is a myth.", "Cancel culture threatened this poor mans livelihood! and then also terrible service! one star! no tip! This is the center of cancel culture.", "Seriously needs to gtfo! The exact assholes who are so vocally against cancel culture are the ones who like keem, who went as far to weaponize his fanbase bullied and harassed Etika.", "Writer, an extremely lazy thinker, a Jeffrey Epstein enabler, and proof that cancel culture is not a thing lol Might I suggest we cancel cancel culture? Ba dum tss Srsly cancel culture is stupid.", "How are you helping this conversation by excusing it? If you whine about cancel culture in entertainment, I expect you to be also advocating for actresses who cant get work after they turn 40.", "Kelly, Harvey Weinstein and Linda Feinstein for example.", "The act of removing the scene only brings more attention to a quick blip on the screen.", "Maybe theyve matured with age and it will be Rage Against Cancel Culture.", "Probably the Cancel Culture Warrior dont approve of Cancelcancelculturenow Don Jr.", "On my nerves tonite Im not apart of cancel culture but these zits need to go.", "Seriously, they need to press charges on her, false allegations leading to wrongful termination and wrongful death.", "You might cheer Cherrys departure, but you wont like it when they come for you and yours.", "Macdonald talks about Cancelculture Fangirling Idontbelievethesemfs This is the worst time ever to be a celebrity, he says in the special, which was released Mon.", "Cancelculture, which is really a manifestation of deconstructionism, is destroying opportunities for correction and growth.", "Did you read his apartment requirements? It sounded like he was holding auditions.", "When do I post it? Cancel culture is an outpouring of Outrage culture.", "Life, there is one thing everybody should learn from all of this.", "For a culture of respect is not the same thing as canceling culture.", "Take a Live Look At This House Right Now? The new cancel culture is the product of a generation born into a world w out obscuring myth.", "I think its important we realize how overblown the idea of it is, how the mild criticism, intra community feedback, personal dislike, etc.", "The only comedic thing about your network is where your loyalties lie.", "This perfectly portrays the hypocrisy amp; stupidity of cancel culture.", "Im disappointed in the platforms moderation at this present time.", "But cancel culture and removing toxic people from your life are two different things.", "Yall do not know how to disagree with someone amp; keep it moving.", "People almost never have their careers affected for long term.", "Given the ongoing polarization of our society, cancel culture, doxxing, etc, etc, I wonder how much longer the system can stay together.", "He deserves to be held to the same standard Carson was.", "Cancel culture People complaining about cancel culture People saying shitty things that get offended when you point out that theyre saying shitty things Love Island.", "If you need a demonstration of how unrepentently toxic cancel culture is, here it is.", "Cancel culture one of the worst recent trends cancel culture the worst thing to happen to twitter since they changed the avis to circles.", "Both are now used to make weak arguments when they started out with honest intent.", "Common thing I see is, everyone talking about cancel culture sounds like theyre afraid someones gonna find out something they did.", "Wtf!?! 3 million bravo Carson King Defies Cancel Culture by Raising Even More Money uspoli Gandhi straight up told the British empire to gtfo of India.", "In College I knew it!! It was bound to come out eventually in todays Cancelculture!! Just wait till new photos emerge of accidents soiling the carpet as a puppy! via It sort of.", "Cancel culture is not only bullying but its so immature.", "Yet here they stand as emblems of the possibility for redemption.", "Loved every minute of the new Chappelle special.", "Or is this about more than protecting women? ジョーカー観ました 2時間ずっと痛みと辛さしかない凄まじい映画だった しかし かくも壮絶に声なき者 存在なき者についての映画を撮れた監督が コメディが死んだのは woke cancel culture のせい など何故言えてしまうのかは理解不能 You people are hilarious.", "Can we leave cancel culture and overly sensitive people in 2019 please?! I can also do without the woke as well.", "This system in the increasingly overt collaboration between cancel culture activists and the tech monopolies.", "And access to resources I love cancel culture.", "You know whats even More toxic? contributing to the continued glory and success of abusers and rapist.", "How to Manage Brands In a Cancel Culture via There is no such thing as cancel culture 2 Forgiveness does not mean acceptance.", "People are mistaken blind hate as calling out for their mistakes, which is just wrong.", "By Embracing Impeachment, Liberals Reveal Their Addiction to Cancel Culture I have the fucking receipts.", "I am thoroughly enjoying watching Aarons old tweets being reposted.", "Cancel culture didnt cause Etikas death; mental health did.", "Problematic Artists via twitter cancel culture fucks up another innocent band ep.", "The Left cant stop the circular firing squads they create w pc amp; Socialjustice intolerance Latest victim of Cancelculture Gandhi Mahatma freakin Gandhi Mr.", "Cancel culture is that it is fixated around the concept that humans cant change for the better and grow into more tolerant human beings.", "Channon, there are videos of you stomping on live animals till they died, getting eaten out by a dog, and wearing nazi lingerie.", "When that criticism comes its automatically elevated to the non existent cancel culture.", "You are pushing cancel culture which is literally so shit.", "It feels not so much like cancel culture as a time to have eyes ears minds amp; hearts opened wider.", "I think cancel culture is childish Can we cancel cancel culture.", "Imagine being dumb enough to be a part of cancel culture, but can we please cancel all women fictional characters ever written by men? I mean all of them, ever?? Cancel culture eats Sarahsilverman.", "News Daily on Thursday that the promotion of cancel culture in America is a disservice to our country and dangerous because it creates a culture of fear.", "Barack Obamas warning about cancel culture goes viral The only people looking to restrain free speech are folks like who want to limit online speech, and the cancel culture crowd.", "People get off your high horse ya twat Contrapoints hm.", "Its a large scale fan exodus taking the social media world by storm.", "The funniest shit about cancel culture is folks be saying that shit like its button that they press and that person just deemed hell afterwards.", "Its a whole world outside of social media where folks dont give a fuck about ur follower count or if blacktwitter has dragged you for filth.", "Holding people accountable is just not supporting them or their work.", "Thats only ever granted to white men so jk guess Ill just keep trying not to be an asshole.", "The female voice in ya retellings of classic fairytales The Not So Feminist leads in ya Dystopian novels Goodreads, Cancel Culture, and Yatwitter Please rt! I hate Cancelculture.", "Cancel Culture then the thing you need to do is stand up for people you dont like, saying things you dont want to hear.", "Were right about shaggy fuck cancel culture Really sad to see all this nasty mob mentality that seems to thrive on Twitter.", "Boot these fake fucks out of the community for good.", "A job, doing actions on your own accord, and receiving the consequences.", "As says, its not cancel culture, its consequences culture.", "Thank god there was no cancel culture during the 2000s Eminem era cause we wouldve missed out on so much greatness Cancel the cancel culture and just love.", "What astounds me is how the fuck we even got to this point at all?!? _ Thursdaythoughts Call it cancel culture if you want.", "Cancelculture will cancel Bill Peters, apology or not.", "What a time, etc Keep that white girl talm bout cancel culture off my tl.", "Were on very similar pages, though I dont like to see anyone fall to cancel culture precisely because I fundamentally disagree with cancel culture.", "Cancelling cancel culture, we need to pause think, What do the survivors need to heal and be restored? How can I support that? Center the person impacted.", "A long list of people who have been cancelled for running afoul of conservative political correctness.", "No men have been harmed in the production of the consequences of their own actions.", "This, ladies and gents, is why cancel culture and Sjws suck.", "We should shop at Chick Fil a all the more in the wake of this news.", "Traditionsthatneedtogo This is exactly why cancel culture is toxic.", "Its being brought up so you all can shut the fuck up.", "Use a Noise Cancelling Headphone, Says Cancel Culture is Toxic That he should explain to the Yanggang that Humanityfirst isnt a new way to Cancel Culture tone police.", "Niggas only have issues with cancel culture cause theyve done some questionable stuff themselves.", "Like well you cant stan that person ans they attack you if you still like the person.", "Available on Redbubble Teepublic get it cheap here for the next 72 hours Etsy soon.", "Solange ene will be celebrated Berners were dying to have something to attack Andrew on and they got their wish in a 2 minute clip.", "Again cancel culture is a fantasy culture that doesnt exist.", "People in your life is an easy out.", "If you cannot take a joke dont watch comedy.", "Under the impression that cancel culture was the recurring theme of destroying a persons life career over rumors, unproven accusations, or offensive actions the person took decades ago.", "Agreed that Twitter has become this thing designed to make ppl seem smarter cooler better.", "The way yall acting like cancel culture is a good thing Excellent papier dans d sur la scène comique américaine et la cancel culture.", "Cancel culture is just a combination of malice, jealously and hypocrisy.", "I dont think cancel culture is real for the reason you mentioned but also because it disproportionately affects women more, Black women especially.", "Something in your past youre worried about? Identity politics is what people say when they want to maintain the one identity that has always ruled politics.", "Because someone might have a different opinion from yours? Maybe u could accept that 4 what it is.", "Were trying to get folks to not buy his book.", "Grow from it then Whats da problemo????? 3.", "Im not one for cancel culture but if youre abusing animals, seriously fuck you and you deserve to be punished Call it Cancel Culture, I dont care.", "President Obama talking about the cancel culture woketivists.", "When will cancel culture be over Also, fuck cancel culture.", "More Recent Boycotts Newsweek fitness trend Twitter trending topic currently boycottolivegarden Who.", "Heres what the proponents of Cancelculture would have you believe; Society has become so politically correct you cant joke about anything without getting cancelled.", "Everyone who disagrees with me is a troll approch and listen to what people have to say? Fake woke people, Cancel Culture, Part time Protesters.", "Cancel Culture destroys careers! 1! Are we really trying to cancel Michael Che? This cancel culture bullshit needs to stop.", "The Cookout And more! This cancel culture is honestly the worst thing to happen to social media.", "Barack Obama gets exactly right about our toxic cancel culture Analysis by Cnns Chris Cillizza Hannibal Buress.", "So tired of hearing about how bad cancel culture is.", "K sweetie Nawwww idc, from now on im not fucking with anyone that contributes to the absolute joke that is cancel culture.", "Ados dos or doas but they need to reach out to the only allies that matter here.", "Cancel culture isnt real its just a meme template that currently happens to get cancelled.", "This is us saying fuck you no to people who hurt us and our communities.", "Have all immigrants since ww1 been brown or black? Nobody mentioned race except the lunatic left cancel culture.", "This is cancel culture Cancel culture harms small people and Cancel culture doesnt touch big people are both just ways of saying Cancel culture doesnt bring justice.", "Cancel culture has nothing to do with legit critique and everything to do with shaming and ostracism cancel culture is the worst.", "I still havent seen any evidence that performative woke shit from politicians moves any needles outside of the extremely online viral crowd.", "Folded like the cheap politically correct org they are.", "Projecting your own insecurities onto someone just bc you dont wanna see them succeed isnt cute.", "Walkaway movement, attending a event in celebration of criminal justice reform plus more.", "My Marxist friend who grew up in the Soviet Union thinks American liberal cancel culture is very much like the soviet police state, just not fully integrated with the government.", "Do You Really Want To Hurt Me is my favorite Cancel Culture Club song.", "I dont think picking the 4 in the beginning was racist ageist.", "New Video! Please Share! Fired Social Media Manager For riot Games Has Taken To Twitter To Try amp; Cancel a Former Co Worker! I Am Sure Being fired Has nothing To Do With It.", "It cannot be overstated how much of the hand wringing over cancel culture is such bullshit.", "Yall put up new rules everyday that were supposed to follow as humans amp; its not okay, its impossible.", "Its long been wielded by the nhl establishment my latest.", "Cancelculture consideration capitalism amp; cheese Good for you.", "At weve been covering the free speech backlash since long before it started being called cancel culture.", "Discusses Cancel Culture Coming After Comedians via Orgasm denial is just cancel culture for cum Folks like Vic Mignogna and Projared didnt lose respect because of cancel culture.", "So Cancel culture also has a side of.", "We need to leave space for rehabilitation restoration after some form of punishment therapy.", "But rape culture sure does The problem with cancel culture is that not one mf is unprobelmatic.", "In this era of Cancel Culture, disavowing and other forms of wokeness, I find it odd nobody makes a big deal of all the Army posts named after Confederate generals.", "Cancel culture has its own undermining maybe even evil side, and its one of reasons some stick with Trump.", "Exhibit a of how cancel culture isnt real doesnt work and is only a surface level annoyance to a celebrity.", "Break Your Bones On Patriarchy, Cancel Culture and Dave Chappelle If youre part of cancel culture im just assume you broke."]}